app/views/sessions/new.html.erb

	<input type="button" onclick="signout()" value=<%= t(:"Sign out") %>>
	<h1><%= t(:"You logged in as") %> <%= User.find_by_id(current_user).login%></h1>
---
SELECT 1 FROM "users" WHERE ("users"."login" = 'a' AND "users"."id" != 2) LIMIT 1