app/controllers/dz3_controller.rb

  def poisk
	find_item=params[:form][:find_item]
	find_category=params[:form][:find_category].to_i
	case find_category
		when 1
			@result=Bibl.where(:title=>find_item.downcase)
		when 2
			@result=Bibl.where(:author=>find_item.downcase)
		when 3
			@result=Bibl.where(:subject=>find_item.downcase)
		when 4
			@result=Bibl.where(:format=>find_item.downcase)
		when 5
			@result=Bibl.where(:language=>find_item.downcase)
		when 6
			@result=Bibl.where(:publisher=>find_item.downcase)
---
SELECT "bibls".* FROM "bibls" WHERE "bibls"."title" = '' LIMIT 1
SELECT "bibls".* FROM "bibls" WHERE "bibls"."author" = 'a'
SELECT "bibls".* FROM "bibls" WHERE "bibls"."subject" = 'a'
SELECT "bibls".* FROM "bibls" WHERE "bibls"."format" = 'djvu'
SELECT "bibls".* FROM "bibls" WHERE "bibls"."language" = 'ru'
SELECT "bibls".* FROM "bibls" WHERE "bibls"."publisher" = 'alex' LIMIT 1

  def add
	p params[:form]
	p title=params[:form][:title]
	p author=params[:form][:author]
	p subject=params[:form][:subject]
	p format=params[:form][:format]
	p language=params[:form][:language]
	p publisher=User.find_by_id(current_user).login
	p source=params[:form][:source]
	res=Bibl.where(:title=>title.downcase, :source=>source.downcase, :publisher=>publisher.downcase, :format=>format.downcase)
	if (res.size!=0)
		p res
		s=t(:"This element is already exists in base")
	else
		p res
		if File.exists? Rails.root.to_s+"/public/files/"+source+"."+format
			res=Bibl.create :title=>title.downcase, :author=>author.downcase, :subject=>subject.downcase, :format=>format.downcase, :language=>language.downcase, :publisher=>publisher.downcase, :source=>source.downcase
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "bibls".* FROM "bibls" WHERE "bibls"."title" = '' AND "bibls"."source" = 'bessonov_eltech1' AND "bibls"."publisher" = 'a' AND "bibls"."format" = ''
SELECT COUNT(*) FROM "bibls" WHERE "bibls"."title" = '' AND "bibls"."source" = 'bessonov_eltech1' AND "bibls"."publisher" = 'a' AND "bibls"."format" = ''
INSERT INTO "bibls" ("author", "created_at", "format", "language", "publisher", "source", "subject", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
	p params[:form]
	p title=params[:form][:title]
	p author=params[:form][:author]
	p subject=params[:form][:subject]
	p format=params[:form][:format]
	p language=params[:form][:language]
	p publisher=User.find_by_id(current_user).login
	p source=params[:form][:source]
	p id=params[:form][:id].to_i
	if File.exists? Rails.root.to_s+"/public/files/"+source+"."+format
		puts "!!!!"
		res=Bibl.find_by_id(id)
		p res
		res.title=title.downcase
		res.author=author.downcase
		res.subject=subject.downcase
		res.format=format.downcase
		res.language=language.downcase
		res.publisher=publisher.downcase
		res.source=source.downcase
		if res.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "bibls".* FROM "bibls" WHERE "bibls"."id" = 12 LIMIT 1
UPDATE "bibls" SET "author" = 'asd', "subject" = 'qwe', "language" = 'zxc', "publisher" = 'a', "updated_at" = '2012-12-25 03:27:28.156772' WHERE "bibls"."id" = 16

  def delete
	p id=params[:item].to_i
	res=Bibl.where(:id=>id)
---
SELECT "bibls".* FROM "bibls" WHERE "bibls"."id" = 1