app/controllers/users_controller.rb

  def create
	@flag=true
	if params[:user][:login]=="" || params[:user][:password]==""
	   kol=0
	   error_list=""
	   if params[:user][:login]==""
		 kol+=1
		 error_list+=kol.to_s+t(:") Field 'login' is not filled\n")
	   end
	   if params[:user][:password]==""
		 kol+=1
		 error_list+=kol.to_s+t(:") Field 'password' is not filled\n")
	   end
	   puts kol.to_s+t(:" error(s) prohibited this user from being saved:")+ error_list
	   @user=User.new
	   respond_to do |format|
          format.html {flash[:notice]= kol.to_s+t(:" error(s) prohibited this user from being saved:")+"\n"+ error_list; render action: "new"}
          format.json { render json: kol.to_s+t(:" error(s) prohibited this user from being saved:")+ error_list}
        end
    else
	    @user = User.new(params[:user])
    	respond_to do |format|
		  if @user.save
---
INSERT INTO "users" ("created_at", "login", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 22 Dec 2012 22:37:34 UTC +00:00], ["login", "alexey"], ["password", "alexey"], ["updated_at", Sat, 22 Dec 2012 22:37:34 UTC +00:00]]

  def update
    if params[:user][:login]=="" || params[:user][:password]==""
	   kol=0
	   error_list=""
	   if params[:user][:login]==""
		 kol+=1
		 error_list+=kol.to_s+t(:") Field 'login' is not filled\n")
	   end
	   if params[:user][:password]==""
		 kol+=1
		 error_list+=kol.to_s+t(:") Field 'password' is not filled\n")
	   end
	   puts kol.to_s+t(:" error(s) prohibited this user from being saved:")+ error_list
	   @user = User.find(params[:id])
	   respond_to do |format|
          format.html { flash[:notice]= kol.to_s+t(:" error(s) prohibited this user from being saved:")+"\n"+ error_list; render action: "show"; }
          format.json { render json: kol.to_s+t(:" error(s) prohibited this user from being saved:")+ error_list}
        end
    else
		@user = User.find(params[:id])

		respond_to do |format|
		  if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "password" = 'c', "updated_at" = '2012-12-23 11:53:57.654165' WHERE "users"."id" = 4